{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "u2net_working_model",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              320,
              320,
              3
            ],
            "dtype": "float32",
            "name": "input_1"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "activation": "relu",
            "name": "conv1"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 16,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "activation": "relu",
            "name": "conv2"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 1,
            "kernel_size": [
              1,
              1
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "activation": "sigmoid",
            "name": "output"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "model.weights.bin"
      ],
      "weights": [
        {
          "name": "conv1/kernel",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2/kernel",
          "shape": [
            3,
            3,
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [
            1,
            1,
            16,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}